trimmed = ['是否属于医保：',
           '医保疾病',
           '发病部位：',
           '肠',
           '挂号的科室：',
           '消化内科',
           '传染性：',
           '无传染性',
           '治疗方法：',
           '药物治疗',
           '治愈率：',
           '98%(经过系统治疗本病都能系统治愈，治愈率在98%以上。)',
           '治疗周期：',
           '2--3天',
           '多发人群：',
           '所有人群，饮食不当的群体，多于青年',
           '治疗费用：',
           '市三甲医院约（1000 —— 3000元）',
           '典型症状：',
           '肚子疼',
           '里急后重',
           '体重减轻',
           '临床检查：',
           '十二指肠钡餐造影',
           '内镜检查',
           '结肠造影',
           '并发症：',
           '阿米巴结肠炎',
           '慢性溃疡性非肉芽...',
           '老年人假膜性小肠...']
parsed = {}
i = 0
while i < len(trimmed):
    c_ = trimmed[i]
    if c_.endswith('：'):
        l_ = []
        i += 1
        while i < len(trimmed) and not trimmed[i].endswith('：'):
            l_.append(trimmed[i])
            i += 1
        parsed[c_[:-1]] = l_ if len(l_) > 1 else l_.pop()

print(parsed)
